{"<pad>": 0, "<unk>": 1, "AAAAAA": 2, "AAAAAC": 3, "AAAAAG": 4, "AAAAAT": 5, "AAAACA": 6, "AAAACC": 7, "AAAACG": 8, "AAAACT": 9, "AAAAGA": 10, "AAAAGC": 11, "AAAAGG": 12, "AAAAGT": 13, "AAAATA": 14, "AAAATC": 15, "AAAATG": 16, "AAAATT": 17, "AAACAA": 18, "AAACAC": 19, "AAACAG": 20, "AAACAT": 21, "AAACCA": 22, "AAACCC": 23, "AAACCG": 24, "AAACCT": 25, "AAACGA": 26, "AAACGC": 27, "AAACGG": 28, "AAACGT": 29, "AAACTA": 30, "AAACTC": 31, "AAACTG": 32, "AAACTT": 33, "AAAGAA": 34, "AAAGAC": 35, "AAAGAG": 36, "AAAGAT": 37, "AAAGCA": 38, "AAAGCC": 39, "AAAGCG": 40, "AAAGCT": 41, "AAAGGA": 42, "AAAGGC": 43, "AAAGGG": 44, "AAAGGT": 45, "AAAGTA": 46, "AAAGTC": 47, "AAAGTG": 48, "AAAGTT": 49, "AAATAA": 50, "AAATAC": 51, "AAATAG": 52, "AAATAT": 53, "AAATCA": 54, "AAATCC": 55, "AAATCG": 56, "AAATCT": 57, "AAATGA": 58, "AAATGC": 59, "AAATGG": 60, "AAATGT": 61, "AAATTA": 62, "AAATTC": 63, "AAATTG": 64, "AAATTT": 65, "AACAAA": 66, "AACAAC": 67, "AACAAG": 68, "AACAAT": 69, "AACACA": 70, "AACACC": 71, "AACACG": 72, "AACACT": 73, "AACAGA": 74, "AACAGC": 75, "AACAGG": 76, "AACAGT": 77, "AACATA": 78, "AACATC": 79, "AACATG": 80, "AACATT": 81, "AACCAA": 82, "AACCAC": 83, "AACCAG": 84, "AACCAT": 85, "AACCCA": 86, "AACCCC": 87, "AACCCG": 88, "AACCCT": 89, "AACCGA": 90, "AACCGC": 91, "AACCGG": 92, "AACCGT": 93, "AACCTA": 94, "AACCTC": 95, "AACCTG": 96, "AACCTT": 97, "AACGAA": 98, "AACGAC": 99, "AACGAG": 100, "AACGAT": 101, "AACGCA": 102, "AACGCC": 103, "AACGCG": 104, "AACGCT": 105, "AACGGA": 106, "AACGGC": 107, "AACGGG": 108, "AACGGT": 109, "AACGTA": 110, "AACGTC": 111, "AACGTG": 112, "AACGTT": 113, "AACTAA": 114, "AACTAC": 115, "AACTAG": 116, "AACTAT": 117, "AACTCA": 118, "AACTCC": 119, "AACTCG": 120, "AACTCT": 121, "AACTGA": 122, "AACTGC": 123, "AACTGG": 124, "AACTGT": 125, "AACTTA": 126, "AACTTC": 127, "AACTTG": 128, "AACTTT": 129, "AAGAAA": 130, "AAGAAC": 131, "AAGAAG": 132, "AAGAAT": 133, "AAGACA": 134, "AAGACC": 135, "AAGACG": 136, "AAGACT": 137, "AAGAGA": 138, "AAGAGC": 139, "AAGAGG": 140, "AAGAGT": 141, "AAGATA": 142, "AAGATC": 143, "AAGATG": 144, "AAGATT": 145, "AAGCAA": 146, "AAGCAC": 147, "AAGCAG": 148, "AAGCAT": 149, "AAGCCA": 150, "AAGCCC": 151, "AAGCCG": 152, "AAGCCT": 153, "AAGCGA": 154, "AAGCGC": 155, "AAGCGG": 156, "AAGCGT": 157, "AAGCTA": 158, "AAGCTC": 159, "AAGCTG": 160, "AAGCTT": 161, "AAGGAA": 162, "AAGGAC": 163, "AAGGAG": 164, "AAGGAT": 165, "AAGGCA": 166, "AAGGCC": 167, "AAGGCG": 168, "AAGGCT": 169, "AAGGGA": 170, "AAGGGC": 171, "AAGGGG": 172, "AAGGGT": 173, "AAGGTA": 174, "AAGGTC": 175, "AAGGTG": 176, "AAGGTT": 177, "AAGTAA": 178, "AAGTAC": 179, "AAGTAG": 180, "AAGTAT": 181, "AAGTCA": 182, "AAGTCC": 183, "AAGTCG": 184, "AAGTCT": 185, "AAGTGA": 186, "AAGTGC": 187, "AAGTGG": 188, "AAGTGT": 189, "AAGTTA": 190, "AAGTTC": 191, "AAGTTG": 192, "AAGTTT": 193, "AATAAA": 194, "AATAAC": 195, "AATAAG": 196, "AATAAT": 197, "AATACA": 198, "AATACC": 199, "AATACG": 200, "AATACT": 201, "AATAGA": 202, "AATAGC": 203, "AATAGG": 204, "AATAGT": 205, "AATATA": 206, "AATATC": 207, "AATATG": 208, "AATATT": 209, "AATCAA": 210, "AATCAC": 211, "AATCAG": 212, "AATCAT": 213, "AATCCA": 214, "AATCCC": 215, "AATCCG": 216, "AATCCT": 217, "AATCGA": 218, "AATCGC": 219, "AATCGG": 220, "AATCGT": 221, "AATCTA": 222, "AATCTC": 223, "AATCTG": 224, "AATCTT": 225, "AATGAA": 226, "AATGAC": 227, "AATGAG": 228, "AATGAT": 229, "AATGCA": 230, "AATGCC": 231, "AATGCG": 232, "AATGCT": 233, "AATGGA": 234, "AATGGC": 235, "AATGGG": 236, "AATGGT": 237, "AATGTA": 238, "AATGTC": 239, "AATGTG": 240, "AATGTT": 241, "AATTAA": 242, "AATTAC": 243, "AATTAG": 244, "AATTAT": 245, "AATTCA": 246, "AATTCC": 247, "AATTCG": 248, "AATTCT": 249, "AATTGA": 250, "AATTGC": 251, "AATTGG": 252, "AATTGT": 253, "AATTTA": 254, "AATTTC": 255, "AATTTG": 256, "AATTTT": 257, "ACAAAA": 258, "ACAAAC": 259, "ACAAAG": 260, "ACAAAT": 261, "ACAACA": 262, "ACAACC": 263, "ACAACG": 264, "ACAACT": 265, "ACAAGA": 266, "ACAAGC": 267, "ACAAGG": 268, "ACAAGT": 269, "ACAATA": 270, "ACAATC": 271, "ACAATG": 272, "ACAATT": 273, "ACACAA": 274, "ACACAC": 275, "ACACAG": 276, "ACACAT": 277, "ACACCA": 278, "ACACCC": 279, "ACACCG": 280, "ACACCT": 281, "ACACGA": 282, "ACACGC": 283, "ACACGG": 284, "ACACGT": 285, "ACACTA": 286, "ACACTC": 287, "ACACTG": 288, "ACACTT": 289, "ACAGAA": 290, "ACAGAC": 291, "ACAGAG": 292, "ACAGAT": 293, "ACAGCA": 294, "ACAGCC": 295, "ACAGCG": 296, "ACAGCT": 297, "ACAGGA": 298, "ACAGGC": 299, "ACAGGG": 300, "ACAGGT": 301, "ACAGTA": 302, "ACAGTC": 303, "ACAGTG": 304, "ACAGTT": 305, "ACATAA": 306, "ACATAC": 307, "ACATAG": 308, "ACATAT": 309, "ACATCA": 310, "ACATCC": 311, "ACATCG": 312, "ACATCT": 313, "ACATGA": 314, "ACATGC": 315, "ACATGG": 316, "ACATGT": 317, "ACATTA": 318, "ACATTC": 319, "ACATTG": 320, "ACATTT": 321, "ACCAAA": 322, "ACCAAC": 323, "ACCAAG": 324, "ACCAAT": 325, "ACCACA": 326, "ACCACC": 327, "ACCACG": 328, "ACCACT": 329, "ACCAGA": 330, "ACCAGC": 331, "ACCAGG": 332, "ACCAGT": 333, "ACCATA": 334, "ACCATC": 335, "ACCATG": 336, "ACCATT": 337, "ACCCAA": 338, "ACCCAC": 339, "ACCCAG": 340, "ACCCAT": 341, "ACCCCA": 342, "ACCCCC": 343, "ACCCCG": 344, "ACCCCT": 345, "ACCCGA": 346, "ACCCGC": 347, "ACCCGG": 348, "ACCCGT": 349, "ACCCTA": 350, "ACCCTC": 351, "ACCCTG": 352, "ACCCTT": 353, "ACCGAA": 354, "ACCGAC": 355, "ACCGAG": 356, "ACCGAT": 357, "ACCGCA": 358, "ACCGCC": 359, "ACCGCG": 360, "ACCGCT": 361, "ACCGGA": 362, "ACCGGC": 363, "ACCGGG": 364, "ACCGGT": 365, "ACCGTA": 366, "ACCGTC": 367, "ACCGTG": 368, "ACCGTT": 369, "ACCTAA": 370, "ACCTAC": 371, "ACCTAG": 372, "ACCTAT": 373, "ACCTCA": 374, "ACCTCC": 375, "ACCTCG": 376, "ACCTCT": 377, "ACCTGA": 378, "ACCTGC": 379, "ACCTGG": 380, "ACCTGT": 381, "ACCTTA": 382, "ACCTTC": 383, "ACCTTG": 384, "ACCTTT": 385, "ACGAAA": 386, "ACGAAC": 387, "ACGAAG": 388, "ACGAAT": 389, "ACGACA": 390, "ACGACC": 391, "ACGACG": 392, "ACGACT": 393, "ACGAGA": 394, "ACGAGC": 395, "ACGAGG": 396, "ACGAGT": 397, "ACGATA": 398, "ACGATC": 399, "ACGATG": 400, "ACGATT": 401, "ACGCAA": 402, "ACGCAC": 403, "ACGCAG": 404, "ACGCAT": 405, "ACGCCA": 406, "ACGCCC": 407, "ACGCCG": 408, "ACGCCT": 409, "ACGCGA": 410, "ACGCGC": 411, "ACGCGG": 412, "ACGCGT": 413, "ACGCTA": 414, "ACGCTC": 415, "ACGCTG": 416, "ACGCTT": 417, "ACGGAA": 418, "ACGGAC": 419, "ACGGAG": 420, "ACGGAT": 421, "ACGGCA": 422, "ACGGCC": 423, "ACGGCG": 424, "ACGGCT": 425, "ACGGGA": 426, "ACGGGC": 427, "ACGGGG": 428, "ACGGGT": 429, "ACGGTA": 430, "ACGGTC": 431, "ACGGTG": 432, "ACGGTT": 433, "ACGTAA": 434, "ACGTAC": 435, "ACGTAG": 436, "ACGTAT": 437, "ACGTCA": 438, "ACGTCC": 439, "ACGTCG": 440, "ACGTCT": 441, "ACGTGA": 442, "ACGTGC": 443, "ACGTGG": 444, "ACGTGT": 445, "ACGTTA": 446, "ACGTTC": 447, "ACGTTG": 448, "ACGTTT": 449, "ACTAAA": 450, "ACTAAC": 451, "ACTAAG": 452, "ACTAAT": 453, "ACTACA": 454, "ACTACC": 455, "ACTACG": 456, "ACTACT": 457, "ACTAGA": 458, "ACTAGC": 459, "ACTAGG": 460, "ACTAGT": 461, "ACTATA": 462, "ACTATC": 463, "ACTATG": 464, "ACTATT": 465, "ACTCAA": 466, "ACTCAC": 467, "ACTCAG": 468, "ACTCAT": 469, "ACTCCA": 470, "ACTCCC": 471, "ACTCCG": 472, "ACTCCT": 473, "ACTCGA": 474, "ACTCGC": 475, "ACTCGG": 476, "ACTCGT": 477, "ACTCTA": 478, "ACTCTC": 479, "ACTCTG": 480, "ACTCTT": 481, "ACTGAA": 482, "ACTGAC": 483, "ACTGAG": 484, "ACTGAT": 485, "ACTGCA": 486, "ACTGCC": 487, "ACTGCG": 488, "ACTGCT": 489, "ACTGGA": 490, "ACTGGC": 491, "ACTGGG": 492, "ACTGGT": 493, "ACTGTA": 494, "ACTGTC": 495, "ACTGTG": 496, "ACTGTT": 497, "ACTTAA": 498, "ACTTAC": 499, "ACTTAG": 500, "ACTTAT": 501, "ACTTCA": 502, "ACTTCC": 503, "ACTTCG": 504, "ACTTCT": 505, "ACTTGA": 506, "ACTTGC": 507, "ACTTGG": 508, "ACTTGT": 509, "ACTTTA": 510, "ACTTTC": 511, "ACTTTG": 512, "ACTTTT": 513, "AGAAAA": 514, "AGAAAC": 515, "AGAAAG": 516, "AGAAAT": 517, "AGAACA": 518, "AGAACC": 519, "AGAACG": 520, "AGAACT": 521, "AGAAGA": 522, "AGAAGC": 523, "AGAAGG": 524, "AGAAGT": 525, "AGAATA": 526, "AGAATC": 527, "AGAATG": 528, "AGAATT": 529, "AGACAA": 530, "AGACAC": 531, "AGACAG": 532, "AGACAT": 533, "AGACCA": 534, "AGACCC": 535, "AGACCG": 536, "AGACCT": 537, "AGACGA": 538, "AGACGC": 539, "AGACGG": 540, "AGACGT": 541, "AGACTA": 542, "AGACTC": 543, "AGACTG": 544, "AGACTT": 545, "AGAGAA": 546, "AGAGAC": 547, "AGAGAG": 548, "AGAGAT": 549, "AGAGCA": 550, "AGAGCC": 551, "AGAGCG": 552, "AGAGCT": 553, "AGAGGA": 554, "AGAGGC": 555, "AGAGGG": 556, "AGAGGT": 557, "AGAGTA": 558, "AGAGTC": 559, "AGAGTG": 560, "AGAGTT": 561, "AGATAA": 562, "AGATAC": 563, "AGATAG": 564, "AGATAT": 565, "AGATCA": 566, "AGATCC": 567, "AGATCG": 568, "AGATCT": 569, "AGATGA": 570, "AGATGC": 571, "AGATGG": 572, "AGATGT": 573, "AGATTA": 574, "AGATTC": 575, "AGATTG": 576, "AGATTT": 577, "AGCAAA": 578, "AGCAAC": 579, "AGCAAG": 580, "AGCAAT": 581, "AGCACA": 582, "AGCACC": 583, "AGCACG": 584, "AGCACT": 585, "AGCAGA": 586, "AGCAGC": 587, "AGCAGG": 588, "AGCAGT": 589, "AGCATA": 590, "AGCATC": 591, "AGCATG": 592, "AGCATT": 593, "AGCCAA": 594, "AGCCAC": 595, "AGCCAG": 596, "AGCCAT": 597, "AGCCCA": 598, "AGCCCC": 599, "AGCCCG": 600, "AGCCCT": 601, "AGCCGA": 602, "AGCCGC": 603, "AGCCGG": 604, "AGCCGT": 605, "AGCCTA": 606, "AGCCTC": 607, "AGCCTG": 608, "AGCCTT": 609, "AGCGAA": 610, "AGCGAC": 611, "AGCGAG": 612, "AGCGAT": 613, "AGCGCA": 614, "AGCGCC": 615, "AGCGCG": 616, "AGCGCT": 617, "AGCGGA": 618, "AGCGGC": 619, "AGCGGG": 620, "AGCGGT": 621, "AGCGTA": 622, "AGCGTC": 623, "AGCGTG": 624, "AGCGTT": 625, "AGCTAA": 626, "AGCTAC": 627, "AGCTAG": 628, "AGCTAT": 629, "AGCTCA": 630, "AGCTCC": 631, "AGCTCG": 632, "AGCTCT": 633, "AGCTGA": 634, "AGCTGC": 635, "AGCTGG": 636, "AGCTGT": 637, "AGCTTA": 638, "AGCTTC": 639, "AGCTTG": 640, "AGCTTT": 641, "AGGAAA": 642, "AGGAAC": 643, "AGGAAG": 644, "AGGAAT": 645, "AGGACA": 646, "AGGACC": 647, "AGGACG": 648, "AGGACT": 649, "AGGAGA": 650, "AGGAGC": 651, "AGGAGG": 652, "AGGAGT": 653, "AGGATA": 654, "AGGATC": 655, "AGGATG": 656, "AGGATT": 657, "AGGCAA": 658, "AGGCAC": 659, "AGGCAG": 660, "AGGCAT": 661, "AGGCCA": 662, "AGGCCC": 663, "AGGCCG": 664, "AGGCCT": 665, "AGGCGA": 666, "AGGCGC": 667, "AGGCGG": 668, "AGGCGT": 669, "AGGCTA": 670, "AGGCTC": 671, "AGGCTG": 672, "AGGCTT": 673, "AGGGAA": 674, "AGGGAC": 675, "AGGGAG": 676, "AGGGAT": 677, "AGGGCA": 678, "AGGGCC": 679, "AGGGCG": 680, "AGGGCT": 681, "AGGGGA": 682, "AGGGGC": 683, "AGGGGG": 684, "AGGGGT": 685, "AGGGTA": 686, "AGGGTC": 687, "AGGGTG": 688, "AGGGTT": 689, "AGGTAA": 690, "AGGTAC": 691, "AGGTAG": 692, "AGGTAT": 693, "AGGTCA": 694, "AGGTCC": 695, "AGGTCG": 696, "AGGTCT": 697, "AGGTGA": 698, "AGGTGC": 699, "AGGTGG": 700, "AGGTGT": 701, "AGGTTA": 702, "AGGTTC": 703, "AGGTTG": 704, "AGGTTT": 705, "AGTAAA": 706, "AGTAAC": 707, "AGTAAG": 708, "AGTAAT": 709, "AGTACA": 710, "AGTACC": 711, "AGTACG": 712, "AGTACT": 713, "AGTAGA": 714, "AGTAGC": 715, "AGTAGG": 716, "AGTAGT": 717, "AGTATA": 718, "AGTATC": 719, "AGTATG": 720, "AGTATT": 721, "AGTCAA": 722, "AGTCAC": 723, "AGTCAG": 724, "AGTCAT": 725, "AGTCCA": 726, "AGTCCC": 727, "AGTCCG": 728, "AGTCCT": 729, "AGTCGA": 730, "AGTCGC": 731, "AGTCGG": 732, "AGTCGT": 733, "AGTCTA": 734, "AGTCTC": 735, "AGTCTG": 736, "AGTCTT": 737, "AGTGAA": 738, "AGTGAC": 739, "AGTGAG": 740, "AGTGAT": 741, "AGTGCA": 742, "AGTGCC": 743, "AGTGCG": 744, "AGTGCT": 745, "AGTGGA": 746, "AGTGGC": 747, "AGTGGG": 748, "AGTGGT": 749, "AGTGTA": 750, "AGTGTC": 751, "AGTGTG": 752, "AGTGTT": 753, "AGTTAA": 754, "AGTTAC": 755, "AGTTAG": 756, "AGTTAT": 757, "AGTTCA": 758, "AGTTCC": 759, "AGTTCG": 760, "AGTTCT": 761, "AGTTGA": 762, "AGTTGC": 763, "AGTTGG": 764, "AGTTGT": 765, "AGTTTA": 766, "AGTTTC": 767, "AGTTTG": 768, "AGTTTT": 769, "ATAAAA": 770, "ATAAAC": 771, "ATAAAG": 772, "ATAAAT": 773, "ATAACA": 774, "ATAACC": 775, "ATAACG": 776, "ATAACT": 777, "ATAAGA": 778, "ATAAGC": 779, "ATAAGG": 780, "ATAAGT": 781, "ATAATA": 782, "ATAATC": 783, "ATAATG": 784, "ATAATT": 785, "ATACAA": 786, "ATACAC": 787, "ATACAG": 788, "ATACAT": 789, "ATACCA": 790, "ATACCC": 791, "ATACCG": 792, "ATACCT": 793, "ATACGA": 794, "ATACGC": 795, "ATACGG": 796, "ATACGT": 797, "ATACTA": 798, "ATACTC": 799, "ATACTG": 800, "ATACTT": 801, "ATAGAA": 802, "ATAGAC": 803, "ATAGAG": 804, "ATAGAT": 805, "ATAGCA": 806, "ATAGCC": 807, "ATAGCG": 808, "ATAGCT": 809, "ATAGGA": 810, "ATAGGC": 811, "ATAGGG": 812, "ATAGGT": 813, "ATAGTA": 814, "ATAGTC": 815, "ATAGTG": 816, "ATAGTT": 817, "ATATAA": 818, "ATATAC": 819, "ATATAG": 820, "ATATAT": 821, "ATATCA": 822, "ATATCC": 823, "ATATCG": 824, "ATATCT": 825, "ATATGA": 826, "ATATGC": 827, "ATATGG": 828, "ATATGT": 829, "ATATTA": 830, "ATATTC": 831, "ATATTG": 832, "ATATTT": 833, "ATCAAA": 834, "ATCAAC": 835, "ATCAAG": 836, "ATCAAT": 837, "ATCACA": 838, "ATCACC": 839, "ATCACG": 840, "ATCACT": 841, "ATCAGA": 842, "ATCAGC": 843, "ATCAGG": 844, "ATCAGT": 845, "ATCATA": 846, "ATCATC": 847, "ATCATG": 848, "ATCATT": 849, "ATCCAA": 850, "ATCCAC": 851, "ATCCAG": 852, "ATCCAT": 853, "ATCCCA": 854, "ATCCCC": 855, "ATCCCG": 856, "ATCCCT": 857, "ATCCGA": 858, "ATCCGC": 859, "ATCCGG": 860, "ATCCGT": 861, "ATCCTA": 862, "ATCCTC": 863, "ATCCTG": 864, "ATCCTT": 865, "ATCGAA": 866, "ATCGAC": 867, "ATCGAG": 868, "ATCGAT": 869, "ATCGCA": 870, "ATCGCC": 871, "ATCGCG": 872, "ATCGCT": 873, "ATCGGA": 874, "ATCGGC": 875, "ATCGGG": 876, "ATCGGT": 877, "ATCGTA": 878, "ATCGTC": 879, "ATCGTG": 880, "ATCGTT": 881, "ATCTAA": 882, "ATCTAC": 883, "ATCTAG": 884, "ATCTAT": 885, "ATCTCA": 886, "ATCTCC": 887, "ATCTCG": 888, "ATCTCT": 889, "ATCTGA": 890, "ATCTGC": 891, "ATCTGG": 892, "ATCTGT": 893, "ATCTTA": 894, "ATCTTC": 895, "ATCTTG": 896, "ATCTTT": 897, "ATGAAA": 898, "ATGAAC": 899, "ATGAAG": 900, "ATGAAT": 901, "ATGACA": 902, "ATGACC": 903, "ATGACG": 904, "ATGACT": 905, "ATGAGA": 906, "ATGAGC": 907, "ATGAGG": 908, "ATGAGT": 909, "ATGATA": 910, "ATGATC": 911, "ATGATG": 912, "ATGATT": 913, "ATGCAA": 914, "ATGCAC": 915, "ATGCAG": 916, "ATGCAT": 917, "ATGCCA": 918, "ATGCCC": 919, "ATGCCG": 920, "ATGCCT": 921, "ATGCGA": 922, "ATGCGC": 923, "ATGCGG": 924, "ATGCGT": 925, "ATGCTA": 926, "ATGCTC": 927, "ATGCTG": 928, "ATGCTT": 929, "ATGGAA": 930, "ATGGAC": 931, "ATGGAG": 932, "ATGGAT": 933, "ATGGCA": 934, "ATGGCC": 935, "ATGGCG": 936, "ATGGCT": 937, "ATGGGA": 938, "ATGGGC": 939, "ATGGGG": 940, "ATGGGT": 941, "ATGGTA": 942, "ATGGTC": 943, "ATGGTG": 944, "ATGGTT": 945, "ATGTAA": 946, "ATGTAC": 947, "ATGTAG": 948, "ATGTAT": 949, "ATGTCA": 950, "ATGTCC": 951, "ATGTCG": 952, "ATGTCT": 953, "ATGTGA": 954, "ATGTGC": 955, "ATGTGG": 956, "ATGTGT": 957, "ATGTTA": 958, "ATGTTC": 959, "ATGTTG": 960, "ATGTTT": 961, "ATTAAA": 962, "ATTAAC": 963, "ATTAAG": 964, "ATTAAT": 965, "ATTACA": 966, "ATTACC": 967, "ATTACG": 968, "ATTACT": 969, "ATTAGA": 970, "ATTAGC": 971, "ATTAGG": 972, "ATTAGT": 973, "ATTATA": 974, "ATTATC": 975, "ATTATG": 976, "ATTATT": 977, "ATTCAA": 978, "ATTCAC": 979, "ATTCAG": 980, "ATTCAT": 981, "ATTCCA": 982, "ATTCCC": 983, "ATTCCG": 984, "ATTCCT": 985, "ATTCGA": 986, "ATTCGC": 987, "ATTCGG": 988, "ATTCGT": 989, "ATTCTA": 990, "ATTCTC": 991, "ATTCTG": 992, "ATTCTT": 993, "ATTGAA": 994, "ATTGAC": 995, "ATTGAG": 996, "ATTGAT": 997, "ATTGCA": 998, "ATTGCC": 999, "ATTGCG": 1000, "ATTGCT": 1001, "ATTGGA": 1002, "ATTGGC": 1003, "ATTGGG": 1004, "ATTGGT": 1005, "ATTGTA": 1006, "ATTGTC": 1007, "ATTGTG": 1008, "ATTGTT": 1009, "ATTTAA": 1010, "ATTTAC": 1011, "ATTTAG": 1012, "ATTTAT": 1013, "ATTTCA": 1014, "ATTTCC": 1015, "ATTTCG": 1016, "ATTTCT": 1017, "ATTTGA": 1018, "ATTTGC": 1019, "ATTTGG": 1020, "ATTTGT": 1021, "ATTTTA": 1022, "ATTTTC": 1023, "ATTTTG": 1024, "ATTTTT": 1025, "CAAAAA": 1026, "CAAAAC": 1027, "CAAAAG": 1028, "CAAAAT": 1029, "CAAACA": 1030, "CAAACC": 1031, "CAAACG": 1032, "CAAACT": 1033, "CAAAGA": 1034, "CAAAGC": 1035, "CAAAGG": 1036, "CAAAGT": 1037, "CAAATA": 1038, "CAAATC": 1039, "CAAATG": 1040, "CAAATT": 1041, "CAACAA": 1042, "CAACAC": 1043, "CAACAG": 1044, "CAACAT": 1045, "CAACCA": 1046, "CAACCC": 1047, "CAACCG": 1048, "CAACCT": 1049, "CAACGA": 1050, "CAACGC": 1051, "CAACGG": 1052, "CAACGT": 1053, "CAACTA": 1054, "CAACTC": 1055, "CAACTG": 1056, "CAACTT": 1057, "CAAGAA": 1058, "CAAGAC": 1059, "CAAGAG": 1060, "CAAGAT": 1061, "CAAGCA": 1062, "CAAGCC": 1063, "CAAGCG": 1064, "CAAGCT": 1065, "CAAGGA": 1066, "CAAGGC": 1067, "CAAGGG": 1068, "CAAGGT": 1069, "CAAGTA": 1070, "CAAGTC": 1071, "CAAGTG": 1072, "CAAGTT": 1073, "CAATAA": 1074, "CAATAC": 1075, "CAATAG": 1076, "CAATAT": 1077, "CAATCA": 1078, "CAATCC": 1079, "CAATCG": 1080, "CAATCT": 1081, "CAATGA": 1082, "CAATGC": 1083, "CAATGG": 1084, "CAATGT": 1085, "CAATTA": 1086, "CAATTC": 1087, "CAATTG": 1088, "CAATTT": 1089, "CACAAA": 1090, "CACAAC": 1091, "CACAAG": 1092, "CACAAT": 1093, "CACACA": 1094, "CACACC": 1095, "CACACG": 1096, "CACACT": 1097, "CACAGA": 1098, "CACAGC": 1099, "CACAGG": 1100, "CACAGT": 1101, "CACATA": 1102, "CACATC": 1103, "CACATG": 1104, "CACATT": 1105, "CACCAA": 1106, "CACCAC": 1107, "CACCAG": 1108, "CACCAT": 1109, "CACCCA": 1110, "CACCCC": 1111, "CACCCG": 1112, "CACCCT": 1113, "CACCGA": 1114, "CACCGC": 1115, "CACCGG": 1116, "CACCGT": 1117, "CACCTA": 1118, "CACCTC": 1119, "CACCTG": 1120, "CACCTT": 1121, "CACGAA": 1122, "CACGAC": 1123, "CACGAG": 1124, "CACGAT": 1125, "CACGCA": 1126, "CACGCC": 1127, "CACGCG": 1128, "CACGCT": 1129, "CACGGA": 1130, "CACGGC": 1131, "CACGGG": 1132, "CACGGT": 1133, "CACGTA": 1134, "CACGTC": 1135, "CACGTG": 1136, "CACGTT": 1137, "CACTAA": 1138, "CACTAC": 1139, "CACTAG": 1140, "CACTAT": 1141, "CACTCA": 1142, "CACTCC": 1143, "CACTCG": 1144, "CACTCT": 1145, "CACTGA": 1146, "CACTGC": 1147, "CACTGG": 1148, "CACTGT": 1149, "CACTTA": 1150, "CACTTC": 1151, "CACTTG": 1152, "CACTTT": 1153, "CAGAAA": 1154, "CAGAAC": 1155, "CAGAAG": 1156, "CAGAAT": 1157, "CAGACA": 1158, "CAGACC": 1159, "CAGACG": 1160, "CAGACT": 1161, "CAGAGA": 1162, "CAGAGC": 1163, "CAGAGG": 1164, "CAGAGT": 1165, "CAGATA": 1166, "CAGATC": 1167, "CAGATG": 1168, "CAGATT": 1169, "CAGCAA": 1170, "CAGCAC": 1171, "CAGCAG": 1172, "CAGCAT": 1173, "CAGCCA": 1174, "CAGCCC": 1175, "CAGCCG": 1176, "CAGCCT": 1177, "CAGCGA": 1178, "CAGCGC": 1179, "CAGCGG": 1180, "CAGCGT": 1181, "CAGCTA": 1182, "CAGCTC": 1183, "CAGCTG": 1184, "CAGCTT": 1185, "CAGGAA": 1186, "CAGGAC": 1187, "CAGGAG": 1188, "CAGGAT": 1189, "CAGGCA": 1190, "CAGGCC": 1191, "CAGGCG": 1192, "CAGGCT": 1193, "CAGGGA": 1194, "CAGGGC": 1195, "CAGGGG": 1196, "CAGGGT": 1197, "CAGGTA": 1198, "CAGGTC": 1199, "CAGGTG": 1200, "CAGGTT": 1201, "CAGTAA": 1202, "CAGTAC": 1203, "CAGTAG": 1204, "CAGTAT": 1205, "CAGTCA": 1206, "CAGTCC": 1207, "CAGTCG": 1208, "CAGTCT": 1209, "CAGTGA": 1210, "CAGTGC": 1211, "CAGTGG": 1212, "CAGTGT": 1213, "CAGTTA": 1214, "CAGTTC": 1215, "CAGTTG": 1216, "CAGTTT": 1217, "CATAAA": 1218, "CATAAC": 1219, "CATAAG": 1220, "CATAAT": 1221, "CATACA": 1222, "CATACC": 1223, "CATACG": 1224, "CATACT": 1225, "CATAGA": 1226, "CATAGC": 1227, "CATAGG": 1228, "CATAGT": 1229, "CATATA": 1230, "CATATC": 1231, "CATATG": 1232, "CATATT": 1233, "CATCAA": 1234, "CATCAC": 1235, "CATCAG": 1236, "CATCAT": 1237, "CATCCA": 1238, "CATCCC": 1239, "CATCCG": 1240, "CATCCT": 1241, "CATCGA": 1242, "CATCGC": 1243, "CATCGG": 1244, "CATCGT": 1245, "CATCTA": 1246, "CATCTC": 1247, "CATCTG": 1248, "CATCTT": 1249, "CATGAA": 1250, "CATGAC": 1251, "CATGAG": 1252, "CATGAT": 1253, "CATGCA": 1254, "CATGCC": 1255, "CATGCG": 1256, "CATGCT": 1257, "CATGGA": 1258, "CATGGC": 1259, "CATGGG": 1260, "CATGGT": 1261, "CATGTA": 1262, "CATGTC": 1263, "CATGTG": 1264, "CATGTT": 1265, "CATTAA": 1266, "CATTAC": 1267, "CATTAG": 1268, "CATTAT": 1269, "CATTCA": 1270, "CATTCC": 1271, "CATTCG": 1272, "CATTCT": 1273, "CATTGA": 1274, "CATTGC": 1275, "CATTGG": 1276, "CATTGT": 1277, "CATTTA": 1278, "CATTTC": 1279, "CATTTG": 1280, "CATTTT": 1281, "CCAAAA": 1282, "CCAAAC": 1283, "CCAAAG": 1284, "CCAAAT": 1285, "CCAACA": 1286, "CCAACC": 1287, "CCAACG": 1288, "CCAACT": 1289, "CCAAGA": 1290, "CCAAGC": 1291, "CCAAGG": 1292, "CCAAGT": 1293, "CCAATA": 1294, "CCAATC": 1295, "CCAATG": 1296, "CCAATT": 1297, "CCACAA": 1298, "CCACAC": 1299, "CCACAG": 1300, "CCACAT": 1301, "CCACCA": 1302, "CCACCC": 1303, "CCACCG": 1304, "CCACCT": 1305, "CCACGA": 1306, "CCACGC": 1307, "CCACGG": 1308, "CCACGT": 1309, "CCACTA": 1310, "CCACTC": 1311, "CCACTG": 1312, "CCACTT": 1313, "CCAGAA": 1314, "CCAGAC": 1315, "CCAGAG": 1316, "CCAGAT": 1317, "CCAGCA": 1318, "CCAGCC": 1319, "CCAGCG": 1320, "CCAGCT": 1321, "CCAGGA": 1322, "CCAGGC": 1323, "CCAGGG": 1324, "CCAGGT": 1325, "CCAGTA": 1326, "CCAGTC": 1327, "CCAGTG": 1328, "CCAGTT": 1329, "CCATAA": 1330, "CCATAC": 1331, "CCATAG": 1332, "CCATAT": 1333, "CCATCA": 1334, "CCATCC": 1335, "CCATCG": 1336, "CCATCT": 1337, "CCATGA": 1338, "CCATGC": 1339, "CCATGG": 1340, "CCATGT": 1341, "CCATTA": 1342, "CCATTC": 1343, "CCATTG": 1344, "CCATTT": 1345, "CCCAAA": 1346, "CCCAAC": 1347, "CCCAAG": 1348, "CCCAAT": 1349, "CCCACA": 1350, "CCCACC": 1351, "CCCACG": 1352, "CCCACT": 1353, "CCCAGA": 1354, "CCCAGC": 1355, "CCCAGG": 1356, "CCCAGT": 1357, "CCCATA": 1358, "CCCATC": 1359, "CCCATG": 1360, "CCCATT": 1361, "CCCCAA": 1362, "CCCCAC": 1363, "CCCCAG": 1364, "CCCCAT": 1365, "CCCCCA": 1366, "CCCCCC": 1367, "CCCCCG": 1368, "CCCCCT": 1369, "CCCCGA": 1370, "CCCCGC": 1371, "CCCCGG": 1372, "CCCCGT": 1373, "CCCCTA": 1374, "CCCCTC": 1375, "CCCCTG": 1376, "CCCCTT": 1377, "CCCGAA": 1378, "CCCGAC": 1379, "CCCGAG": 1380, "CCCGAT": 1381, "CCCGCA": 1382, "CCCGCC": 1383, "CCCGCG": 1384, "CCCGCT": 1385, "CCCGGA": 1386, "CCCGGC": 1387, "CCCGGG": 1388, "CCCGGT": 1389, "CCCGTA": 1390, "CCCGTC": 1391, "CCCGTG": 1392, "CCCGTT": 1393, "CCCTAA": 1394, "CCCTAC": 1395, "CCCTAG": 1396, "CCCTAT": 1397, "CCCTCA": 1398, "CCCTCC": 1399, "CCCTCG": 1400, "CCCTCT": 1401, "CCCTGA": 1402, "CCCTGC": 1403, "CCCTGG": 1404, "CCCTGT": 1405, "CCCTTA": 1406, "CCCTTC": 1407, "CCCTTG": 1408, "CCCTTT": 1409, "CCGAAA": 1410, "CCGAAC": 1411, "CCGAAG": 1412, "CCGAAT": 1413, "CCGACA": 1414, "CCGACC": 1415, "CCGACG": 1416, "CCGACT": 1417, "CCGAGA": 1418, "CCGAGC": 1419, "CCGAGG": 1420, "CCGAGT": 1421, "CCGATA": 1422, "CCGATC": 1423, "CCGATG": 1424, "CCGATT": 1425, "CCGCAA": 1426, "CCGCAC": 1427, "CCGCAG": 1428, "CCGCAT": 1429, "CCGCCA": 1430, "CCGCCC": 1431, "CCGCCG": 1432, "CCGCCT": 1433, "CCGCGA": 1434, "CCGCGC": 1435, "CCGCGG": 1436, "CCGCGT": 1437, "CCGCTA": 1438, "CCGCTC": 1439, "CCGCTG": 1440, "CCGCTT": 1441, "CCGGAA": 1442, "CCGGAC": 1443, "CCGGAG": 1444, "CCGGAT": 1445, "CCGGCA": 1446, "CCGGCC": 1447, "CCGGCG": 1448, "CCGGCT": 1449, "CCGGGA": 1450, "CCGGGC": 1451, "CCGGGG": 1452, "CCGGGT": 1453, "CCGGTA": 1454, "CCGGTC": 1455, "CCGGTG": 1456, "CCGGTT": 1457, "CCGTAA": 1458, "CCGTAC": 1459, "CCGTAG": 1460, "CCGTAT": 1461, "CCGTCA": 1462, "CCGTCC": 1463, "CCGTCG": 1464, "CCGTCT": 1465, "CCGTGA": 1466, "CCGTGC": 1467, "CCGTGG": 1468, "CCGTGT": 1469, "CCGTTA": 1470, "CCGTTC": 1471, "CCGTTG": 1472, "CCGTTT": 1473, "CCTAAA": 1474, "CCTAAC": 1475, "CCTAAG": 1476, "CCTAAT": 1477, "CCTACA": 1478, "CCTACC": 1479, "CCTACG": 1480, "CCTACT": 1481, "CCTAGA": 1482, "CCTAGC": 1483, "CCTAGG": 1484, "CCTAGT": 1485, "CCTATA": 1486, "CCTATC": 1487, "CCTATG": 1488, "CCTATT": 1489, "CCTCAA": 1490, "CCTCAC": 1491, "CCTCAG": 1492, "CCTCAT": 1493, "CCTCCA": 1494, "CCTCCC": 1495, "CCTCCG": 1496, "CCTCCT": 1497, "CCTCGA": 1498, "CCTCGC": 1499, "CCTCGG": 1500, "CCTCGT": 1501, "CCTCTA": 1502, "CCTCTC": 1503, "CCTCTG": 1504, "CCTCTT": 1505, "CCTGAA": 1506, "CCTGAC": 1507, "CCTGAG": 1508, "CCTGAT": 1509, "CCTGCA": 1510, "CCTGCC": 1511, "CCTGCG": 1512, "CCTGCT": 1513, "CCTGGA": 1514, "CCTGGC": 1515, "CCTGGG": 1516, "CCTGGT": 1517, "CCTGTA": 1518, "CCTGTC": 1519, "CCTGTG": 1520, "CCTGTT": 1521, "CCTTAA": 1522, "CCTTAC": 1523, "CCTTAG": 1524, "CCTTAT": 1525, "CCTTCA": 1526, "CCTTCC": 1527, "CCTTCG": 1528, "CCTTCT": 1529, "CCTTGA": 1530, "CCTTGC": 1531, "CCTTGG": 1532, "CCTTGT": 1533, "CCTTTA": 1534, "CCTTTC": 1535, "CCTTTG": 1536, "CCTTTT": 1537, "CGAAAA": 1538, "CGAAAC": 1539, "CGAAAG": 1540, "CGAAAT": 1541, "CGAACA": 1542, "CGAACC": 1543, "CGAACG": 1544, "CGAACT": 1545, "CGAAGA": 1546, "CGAAGC": 1547, "CGAAGG": 1548, "CGAAGT": 1549, "CGAATA": 1550, "CGAATC": 1551, "CGAATG": 1552, "CGAATT": 1553, "CGACAA": 1554, "CGACAC": 1555, "CGACAG": 1556, "CGACAT": 1557, "CGACCA": 1558, "CGACCC": 1559, "CGACCG": 1560, "CGACCT": 1561, "CGACGA": 1562, "CGACGC": 1563, "CGACGG": 1564, "CGACGT": 1565, "CGACTA": 1566, "CGACTC": 1567, "CGACTG": 1568, "CGACTT": 1569, "CGAGAA": 1570, "CGAGAC": 1571, "CGAGAG": 1572, "CGAGAT": 1573, "CGAGCA": 1574, "CGAGCC": 1575, "CGAGCG": 1576, "CGAGCT": 1577, "CGAGGA": 1578, "CGAGGC": 1579, "CGAGGG": 1580, "CGAGGT": 1581, "CGAGTA": 1582, "CGAGTC": 1583, "CGAGTG": 1584, "CGAGTT": 1585, "CGATAA": 1586, "CGATAC": 1587, "CGATAG": 1588, "CGATAT": 1589, "CGATCA": 1590, "CGATCC": 1591, "CGATCG": 1592, "CGATCT": 1593, "CGATGA": 1594, "CGATGC": 1595, "CGATGG": 1596, "CGATGT": 1597, "CGATTA": 1598, "CGATTC": 1599, "CGATTG": 1600, "CGATTT": 1601, "CGCAAA": 1602, "CGCAAC": 1603, "CGCAAG": 1604, "CGCAAT": 1605, "CGCACA": 1606, "CGCACC": 1607, "CGCACG": 1608, "CGCACT": 1609, "CGCAGA": 1610, "CGCAGC": 1611, "CGCAGG": 1612, "CGCAGT": 1613, "CGCATA": 1614, "CGCATC": 1615, "CGCATG": 1616, "CGCATT": 1617, "CGCCAA": 1618, "CGCCAC": 1619, "CGCCAG": 1620, "CGCCAT": 1621, "CGCCCA": 1622, "CGCCCC": 1623, "CGCCCG": 1624, "CGCCCT": 1625, "CGCCGA": 1626, "CGCCGC": 1627, "CGCCGG": 1628, "CGCCGT": 1629, "CGCCTA": 1630, "CGCCTC": 1631, "CGCCTG": 1632, "CGCCTT": 1633, "CGCGAA": 1634, "CGCGAC": 1635, "CGCGAG": 1636, "CGCGAT": 1637, "CGCGCA": 1638, "CGCGCC": 1639, "CGCGCG": 1640, "CGCGCT": 1641, "CGCGGA": 1642, "CGCGGC": 1643, "CGCGGG": 1644, "CGCGGT": 1645, "CGCGTA": 1646, "CGCGTC": 1647, "CGCGTG": 1648, "CGCGTT": 1649, "CGCTAA": 1650, "CGCTAC": 1651, "CGCTAG": 1652, "CGCTAT": 1653, "CGCTCA": 1654, "CGCTCC": 1655, "CGCTCG": 1656, "CGCTCT": 1657, "CGCTGA": 1658, "CGCTGC": 1659, "CGCTGG": 1660, "CGCTGT": 1661, "CGCTTA": 1662, "CGCTTC": 1663, "CGCTTG": 1664, "CGCTTT": 1665, "CGGAAA": 1666, "CGGAAC": 1667, "CGGAAG": 1668, "CGGAAT": 1669, "CGGACA": 1670, "CGGACC": 1671, "CGGACG": 1672, "CGGACT": 1673, "CGGAGA": 1674, "CGGAGC": 1675, "CGGAGG": 1676, "CGGAGT": 1677, "CGGATA": 1678, "CGGATC": 1679, "CGGATG": 1680, "CGGATT": 1681, "CGGCAA": 1682, "CGGCAC": 1683, "CGGCAG": 1684, "CGGCAT": 1685, "CGGCCA": 1686, "CGGCCC": 1687, "CGGCCG": 1688, "CGGCCT": 1689, "CGGCGA": 1690, "CGGCGC": 1691, "CGGCGG": 1692, "CGGCGT": 1693, "CGGCTA": 1694, "CGGCTC": 1695, "CGGCTG": 1696, "CGGCTT": 1697, "CGGGAA": 1698, "CGGGAC": 1699, "CGGGAG": 1700, "CGGGAT": 1701, "CGGGCA": 1702, "CGGGCC": 1703, "CGGGCG": 1704, "CGGGCT": 1705, "CGGGGA": 1706, "CGGGGC": 1707, "CGGGGG": 1708, "CGGGGT": 1709, "CGGGTA": 1710, "CGGGTC": 1711, "CGGGTG": 1712, "CGGGTT": 1713, "CGGTAA": 1714, "CGGTAC": 1715, "CGGTAG": 1716, "CGGTAT": 1717, "CGGTCA": 1718, "CGGTCC": 1719, "CGGTCG": 1720, "CGGTCT": 1721, "CGGTGA": 1722, "CGGTGC": 1723, "CGGTGG": 1724, "CGGTGT": 1725, "CGGTTA": 1726, "CGGTTC": 1727, "CGGTTG": 1728, "CGGTTT": 1729, "CGTAAA": 1730, "CGTAAC": 1731, "CGTAAG": 1732, "CGTAAT": 1733, "CGTACA": 1734, "CGTACC": 1735, "CGTACG": 1736, "CGTACT": 1737, "CGTAGA": 1738, "CGTAGC": 1739, "CGTAGG": 1740, "CGTAGT": 1741, "CGTATA": 1742, "CGTATC": 1743, "CGTATG": 1744, "CGTATT": 1745, "CGTCAA": 1746, "CGTCAC": 1747, "CGTCAG": 1748, "CGTCAT": 1749, "CGTCCA": 1750, "CGTCCC": 1751, "CGTCCG": 1752, "CGTCCT": 1753, "CGTCGA": 1754, "CGTCGC": 1755, "CGTCGG": 1756, "CGTCGT": 1757, "CGTCTA": 1758, "CGTCTC": 1759, "CGTCTG": 1760, "CGTCTT": 1761, "CGTGAA": 1762, "CGTGAC": 1763, "CGTGAG": 1764, "CGTGAT": 1765, "CGTGCA": 1766, "CGTGCC": 1767, "CGTGCG": 1768, "CGTGCT": 1769, "CGTGGA": 1770, "CGTGGC": 1771, "CGTGGG": 1772, "CGTGGT": 1773, "CGTGTA": 1774, "CGTGTC": 1775, "CGTGTG": 1776, "CGTGTT": 1777, "CGTTAA": 1778, "CGTTAC": 1779, "CGTTAG": 1780, "CGTTAT": 1781, "CGTTCA": 1782, "CGTTCC": 1783, "CGTTCG": 1784, "CGTTCT": 1785, "CGTTGA": 1786, "CGTTGC": 1787, "CGTTGG": 1788, "CGTTGT": 1789, "CGTTTA": 1790, "CGTTTC": 1791, "CGTTTG": 1792, "CGTTTT": 1793, "CTAAAA": 1794, "CTAAAC": 1795, "CTAAAG": 1796, "CTAAAT": 1797, "CTAACA": 1798, "CTAACC": 1799, "CTAACG": 1800, "CTAACT": 1801, "CTAAGA": 1802, "CTAAGC": 1803, "CTAAGG": 1804, "CTAAGT": 1805, "CTAATA": 1806, "CTAATC": 1807, "CTAATG": 1808, "CTAATT": 1809, "CTACAA": 1810, "CTACAC": 1811, "CTACAG": 1812, "CTACAT": 1813, "CTACCA": 1814, "CTACCC": 1815, "CTACCG": 1816, "CTACCT": 1817, "CTACGA": 1818, "CTACGC": 1819, "CTACGG": 1820, "CTACGT": 1821, "CTACTA": 1822, "CTACTC": 1823, "CTACTG": 1824, "CTACTT": 1825, "CTAGAA": 1826, "CTAGAC": 1827, "CTAGAG": 1828, "CTAGAT": 1829, "CTAGCA": 1830, "CTAGCC": 1831, "CTAGCG": 1832, "CTAGCT": 1833, "CTAGGA": 1834, "CTAGGC": 1835, "CTAGGG": 1836, "CTAGGT": 1837, "CTAGTA": 1838, "CTAGTC": 1839, "CTAGTG": 1840, "CTAGTT": 1841, "CTATAA": 1842, "CTATAC": 1843, "CTATAG": 1844, "CTATAT": 1845, "CTATCA": 1846, "CTATCC": 1847, "CTATCG": 1848, "CTATCT": 1849, "CTATGA": 1850, "CTATGC": 1851, "CTATGG": 1852, "CTATGT": 1853, "CTATTA": 1854, "CTATTC": 1855, "CTATTG": 1856, "CTATTT": 1857, "CTCAAA": 1858, "CTCAAC": 1859, "CTCAAG": 1860, "CTCAAT": 1861, "CTCACA": 1862, "CTCACC": 1863, "CTCACG": 1864, "CTCACT": 1865, "CTCAGA": 1866, "CTCAGC": 1867, "CTCAGG": 1868, "CTCAGT": 1869, "CTCATA": 1870, "CTCATC": 1871, "CTCATG": 1872, "CTCATT": 1873, "CTCCAA": 1874, "CTCCAC": 1875, "CTCCAG": 1876, "CTCCAT": 1877, "CTCCCA": 1878, "CTCCCC": 1879, "CTCCCG": 1880, "CTCCCT": 1881, "CTCCGA": 1882, "CTCCGC": 1883, "CTCCGG": 1884, "CTCCGT": 1885, "CTCCTA": 1886, "CTCCTC": 1887, "CTCCTG": 1888, "CTCCTT": 1889, "CTCGAA": 1890, "CTCGAC": 1891, "CTCGAG": 1892, "CTCGAT": 1893, "CTCGCA": 1894, "CTCGCC": 1895, "CTCGCG": 1896, "CTCGCT": 1897, "CTCGGA": 1898, "CTCGGC": 1899, "CTCGGG": 1900, "CTCGGT": 1901, "CTCGTA": 1902, "CTCGTC": 1903, "CTCGTG": 1904, "CTCGTT": 1905, "CTCTAA": 1906, "CTCTAC": 1907, "CTCTAG": 1908, "CTCTAT": 1909, "CTCTCA": 1910, "CTCTCC": 1911, "CTCTCG": 1912, "CTCTCT": 1913, "CTCTGA": 1914, "CTCTGC": 1915, "CTCTGG": 1916, "CTCTGT": 1917, "CTCTTA": 1918, "CTCTTC": 1919, "CTCTTG": 1920, "CTCTTT": 1921, "CTGAAA": 1922, "CTGAAC": 1923, "CTGAAG": 1924, "CTGAAT": 1925, "CTGACA": 1926, "CTGACC": 1927, "CTGACG": 1928, "CTGACT": 1929, "CTGAGA": 1930, "CTGAGC": 1931, "CTGAGG": 1932, "CTGAGT": 1933, "CTGATA": 1934, "CTGATC": 1935, "CTGATG": 1936, "CTGATT": 1937, "CTGCAA": 1938, "CTGCAC": 1939, "CTGCAG": 1940, "CTGCAT": 1941, "CTGCCA": 1942, "CTGCCC": 1943, "CTGCCG": 1944, "CTGCCT": 1945, "CTGCGA": 1946, "CTGCGC": 1947, "CTGCGG": 1948, "CTGCGT": 1949, "CTGCTA": 1950, "CTGCTC": 1951, "CTGCTG": 1952, "CTGCTT": 1953, "CTGGAA": 1954, "CTGGAC": 1955, "CTGGAG": 1956, "CTGGAT": 1957, "CTGGCA": 1958, "CTGGCC": 1959, "CTGGCG": 1960, "CTGGCT": 1961, "CTGGGA": 1962, "CTGGGC": 1963, "CTGGGG": 1964, "CTGGGT": 1965, "CTGGTA": 1966, "CTGGTC": 1967, "CTGGTG": 1968, "CTGGTT": 1969, "CTGTAA": 1970, "CTGTAC": 1971, "CTGTAG": 1972, "CTGTAT": 1973, "CTGTCA": 1974, "CTGTCC": 1975, "CTGTCG": 1976, "CTGTCT": 1977, "CTGTGA": 1978, "CTGTGC": 1979, "CTGTGG": 1980, "CTGTGT": 1981, "CTGTTA": 1982, "CTGTTC": 1983, "CTGTTG": 1984, "CTGTTT": 1985, "CTTAAA": 1986, "CTTAAC": 1987, "CTTAAG": 1988, "CTTAAT": 1989, "CTTACA": 1990, "CTTACC": 1991, "CTTACG": 1992, "CTTACT": 1993, "CTTAGA": 1994, "CTTAGC": 1995, "CTTAGG": 1996, "CTTAGT": 1997, "CTTATA": 1998, "CTTATC": 1999, "CTTATG": 2000, "CTTATT": 2001, "CTTCAA": 2002, "CTTCAC": 2003, "CTTCAG": 2004, "CTTCAT": 2005, "CTTCCA": 2006, "CTTCCC": 2007, "CTTCCG": 2008, "CTTCCT": 2009, "CTTCGA": 2010, "CTTCGC": 2011, "CTTCGG": 2012, "CTTCGT": 2013, "CTTCTA": 2014, "CTTCTC": 2015, "CTTCTG": 2016, "CTTCTT": 2017, "CTTGAA": 2018, "CTTGAC": 2019, "CTTGAG": 2020, "CTTGAT": 2021, "CTTGCA": 2022, "CTTGCC": 2023, "CTTGCG": 2024, "CTTGCT": 2025, "CTTGGA": 2026, "CTTGGC": 2027, "CTTGGG": 2028, "CTTGGT": 2029, "CTTGTA": 2030, "CTTGTC": 2031, "CTTGTG": 2032, "CTTGTT": 2033, "CTTTAA": 2034, "CTTTAC": 2035, "CTTTAG": 2036, "CTTTAT": 2037, "CTTTCA": 2038, "CTTTCC": 2039, "CTTTCG": 2040, "CTTTCT": 2041, "CTTTGA": 2042, "CTTTGC": 2043, "CTTTGG": 2044, "CTTTGT": 2045, "CTTTTA": 2046, "CTTTTC": 2047, "CTTTTG": 2048, "CTTTTT": 2049, "GAAAAA": 2050, "GAAAAC": 2051, "GAAAAG": 2052, "GAAAAT": 2053, "GAAACA": 2054, "GAAACC": 2055, "GAAACG": 2056, "GAAACT": 2057, "GAAAGA": 2058, "GAAAGC": 2059, "GAAAGG": 2060, "GAAAGT": 2061, "GAAATA": 2062, "GAAATC": 2063, "GAAATG": 2064, "GAAATT": 2065, "GAACAA": 2066, "GAACAC": 2067, "GAACAG": 2068, "GAACAT": 2069, "GAACCA": 2070, "GAACCC": 2071, "GAACCG": 2072, "GAACCT": 2073, "GAACGA": 2074, "GAACGC": 2075, "GAACGG": 2076, "GAACGT": 2077, "GAACTA": 2078, "GAACTC": 2079, "GAACTG": 2080, "GAACTT": 2081, "GAAGAA": 2082, "GAAGAC": 2083, "GAAGAG": 2084, "GAAGAT": 2085, "GAAGCA": 2086, "GAAGCC": 2087, "GAAGCG": 2088, "GAAGCT": 2089, "GAAGGA": 2090, "GAAGGC": 2091, "GAAGGG": 2092, "GAAGGT": 2093, "GAAGTA": 2094, "GAAGTC": 2095, "GAAGTG": 2096, "GAAGTT": 2097, "GAATAA": 2098, "GAATAC": 2099, "GAATAG": 2100, "GAATAT": 2101, "GAATCA": 2102, "GAATCC": 2103, "GAATCG": 2104, "GAATCT": 2105, "GAATGA": 2106, "GAATGC": 2107, "GAATGG": 2108, "GAATGT": 2109, "GAATTA": 2110, "GAATTC": 2111, "GAATTG": 2112, "GAATTT": 2113, "GACAAA": 2114, "GACAAC": 2115, "GACAAG": 2116, "GACAAT": 2117, "GACACA": 2118, "GACACC": 2119, "GACACG": 2120, "GACACT": 2121, "GACAGA": 2122, "GACAGC": 2123, "GACAGG": 2124, "GACAGT": 2125, "GACATA": 2126, "GACATC": 2127, "GACATG": 2128, "GACATT": 2129, "GACCAA": 2130, "GACCAC": 2131, "GACCAG": 2132, "GACCAT": 2133, "GACCCA": 2134, "GACCCC": 2135, "GACCCG": 2136, "GACCCT": 2137, "GACCGA": 2138, "GACCGC": 2139, "GACCGG": 2140, "GACCGT": 2141, "GACCTA": 2142, "GACCTC": 2143, "GACCTG": 2144, "GACCTT": 2145, "GACGAA": 2146, "GACGAC": 2147, "GACGAG": 2148, "GACGAT": 2149, "GACGCA": 2150, "GACGCC": 2151, "GACGCG": 2152, "GACGCT": 2153, "GACGGA": 2154, "GACGGC": 2155, "GACGGG": 2156, "GACGGT": 2157, "GACGTA": 2158, "GACGTC": 2159, "GACGTG": 2160, "GACGTT": 2161, "GACTAA": 2162, "GACTAC": 2163, "GACTAG": 2164, "GACTAT": 2165, "GACTCA": 2166, "GACTCC": 2167, "GACTCG": 2168, "GACTCT": 2169, "GACTGA": 2170, "GACTGC": 2171, "GACTGG": 2172, "GACTGT": 2173, "GACTTA": 2174, "GACTTC": 2175, "GACTTG": 2176, "GACTTT": 2177, "GAGAAA": 2178, "GAGAAC": 2179, "GAGAAG": 2180, "GAGAAT": 2181, "GAGACA": 2182, "GAGACC": 2183, "GAGACG": 2184, "GAGACT": 2185, "GAGAGA": 2186, "GAGAGC": 2187, "GAGAGG": 2188, "GAGAGT": 2189, "GAGATA": 2190, "GAGATC": 2191, "GAGATG": 2192, "GAGATT": 2193, "GAGCAA": 2194, "GAGCAC": 2195, "GAGCAG": 2196, "GAGCAT": 2197, "GAGCCA": 2198, "GAGCCC": 2199, "GAGCCG": 2200, "GAGCCT": 2201, "GAGCGA": 2202, "GAGCGC": 2203, "GAGCGG": 2204, "GAGCGT": 2205, "GAGCTA": 2206, "GAGCTC": 2207, "GAGCTG": 2208, "GAGCTT": 2209, "GAGGAA": 2210, "GAGGAC": 2211, "GAGGAG": 2212, "GAGGAT": 2213, "GAGGCA": 2214, "GAGGCC": 2215, "GAGGCG": 2216, "GAGGCT": 2217, "GAGGGA": 2218, "GAGGGC": 2219, "GAGGGG": 2220, "GAGGGT": 2221, "GAGGTA": 2222, "GAGGTC": 2223, "GAGGTG": 2224, "GAGGTT": 2225, "GAGTAA": 2226, "GAGTAC": 2227, "GAGTAG": 2228, "GAGTAT": 2229, "GAGTCA": 2230, "GAGTCC": 2231, "GAGTCG": 2232, "GAGTCT": 2233, "GAGTGA": 2234, "GAGTGC": 2235, "GAGTGG": 2236, "GAGTGT": 2237, "GAGTTA": 2238, "GAGTTC": 2239, "GAGTTG": 2240, "GAGTTT": 2241, "GATAAA": 2242, "GATAAC": 2243, "GATAAG": 2244, "GATAAT": 2245, "GATACA": 2246, "GATACC": 2247, "GATACG": 2248, "GATACT": 2249, "GATAGA": 2250, "GATAGC": 2251, "GATAGG": 2252, "GATAGT": 2253, "GATATA": 2254, "GATATC": 2255, "GATATG": 2256, "GATATT": 2257, "GATCAA": 2258, "GATCAC": 2259, "GATCAG": 2260, "GATCAT": 2261, "GATCCA": 2262, "GATCCC": 2263, "GATCCG": 2264, "GATCCT": 2265, "GATCGA": 2266, "GATCGC": 2267, "GATCGG": 2268, "GATCGT": 2269, "GATCTA": 2270, "GATCTC": 2271, "GATCTG": 2272, "GATCTT": 2273, "GATGAA": 2274, "GATGAC": 2275, "GATGAG": 2276, "GATGAT": 2277, "GATGCA": 2278, "GATGCC": 2279, "GATGCG": 2280, "GATGCT": 2281, "GATGGA": 2282, "GATGGC": 2283, "GATGGG": 2284, "GATGGT": 2285, "GATGTA": 2286, "GATGTC": 2287, "GATGTG": 2288, "GATGTT": 2289, "GATTAA": 2290, "GATTAC": 2291, "GATTAG": 2292, "GATTAT": 2293, "GATTCA": 2294, "GATTCC": 2295, "GATTCG": 2296, "GATTCT": 2297, "GATTGA": 2298, "GATTGC": 2299, "GATTGG": 2300, "GATTGT": 2301, "GATTTA": 2302, "GATTTC": 2303, "GATTTG": 2304, "GATTTT": 2305, "GCAAAA": 2306, "GCAAAC": 2307, "GCAAAG": 2308, "GCAAAT": 2309, "GCAACA": 2310, "GCAACC": 2311, "GCAACG": 2312, "GCAACT": 2313, "GCAAGA": 2314, "GCAAGC": 2315, "GCAAGG": 2316, "GCAAGT": 2317, "GCAATA": 2318, "GCAATC": 2319, "GCAATG": 2320, "GCAATT": 2321, "GCACAA": 2322, "GCACAC": 2323, "GCACAG": 2324, "GCACAT": 2325, "GCACCA": 2326, "GCACCC": 2327, "GCACCG": 2328, "GCACCT": 2329, "GCACGA": 2330, "GCACGC": 2331, "GCACGG": 2332, "GCACGT": 2333, "GCACTA": 2334, "GCACTC": 2335, "GCACTG": 2336, "GCACTT": 2337, "GCAGAA": 2338, "GCAGAC": 2339, "GCAGAG": 2340, "GCAGAT": 2341, "GCAGCA": 2342, "GCAGCC": 2343, "GCAGCG": 2344, "GCAGCT": 2345, "GCAGGA": 2346, "GCAGGC": 2347, "GCAGGG": 2348, "GCAGGT": 2349, "GCAGTA": 2350, "GCAGTC": 2351, "GCAGTG": 2352, "GCAGTT": 2353, "GCATAA": 2354, "GCATAC": 2355, "GCATAG": 2356, "GCATAT": 2357, "GCATCA": 2358, "GCATCC": 2359, "GCATCG": 2360, "GCATCT": 2361, "GCATGA": 2362, "GCATGC": 2363, "GCATGG": 2364, "GCATGT": 2365, "GCATTA": 2366, "GCATTC": 2367, "GCATTG": 2368, "GCATTT": 2369, "GCCAAA": 2370, "GCCAAC": 2371, "GCCAAG": 2372, "GCCAAT": 2373, "GCCACA": 2374, "GCCACC": 2375, "GCCACG": 2376, "GCCACT": 2377, "GCCAGA": 2378, "GCCAGC": 2379, "GCCAGG": 2380, "GCCAGT": 2381, "GCCATA": 2382, "GCCATC": 2383, "GCCATG": 2384, "GCCATT": 2385, "GCCCAA": 2386, "GCCCAC": 2387, "GCCCAG": 2388, "GCCCAT": 2389, "GCCCCA": 2390, "GCCCCC": 2391, "GCCCCG": 2392, "GCCCCT": 2393, "GCCCGA": 2394, "GCCCGC": 2395, "GCCCGG": 2396, "GCCCGT": 2397, "GCCCTA": 2398, "GCCCTC": 2399, "GCCCTG": 2400, "GCCCTT": 2401, "GCCGAA": 2402, "GCCGAC": 2403, "GCCGAG": 2404, "GCCGAT": 2405, "GCCGCA": 2406, "GCCGCC": 2407, "GCCGCG": 2408, "GCCGCT": 2409, "GCCGGA": 2410, "GCCGGC": 2411, "GCCGGG": 2412, "GCCGGT": 2413, "GCCGTA": 2414, "GCCGTC": 2415, "GCCGTG": 2416, "GCCGTT": 2417, "GCCTAA": 2418, "GCCTAC": 2419, "GCCTAG": 2420, "GCCTAT": 2421, "GCCTCA": 2422, "GCCTCC": 2423, "GCCTCG": 2424, "GCCTCT": 2425, "GCCTGA": 2426, "GCCTGC": 2427, "GCCTGG": 2428, "GCCTGT": 2429, "GCCTTA": 2430, "GCCTTC": 2431, "GCCTTG": 2432, "GCCTTT": 2433, "GCGAAA": 2434, "GCGAAC": 2435, "GCGAAG": 2436, "GCGAAT": 2437, "GCGACA": 2438, "GCGACC": 2439, "GCGACG": 2440, "GCGACT": 2441, "GCGAGA": 2442, "GCGAGC": 2443, "GCGAGG": 2444, "GCGAGT": 2445, "GCGATA": 2446, "GCGATC": 2447, "GCGATG": 2448, "GCGATT": 2449, "GCGCAA": 2450, "GCGCAC": 2451, "GCGCAG": 2452, "GCGCAT": 2453, "GCGCCA": 2454, "GCGCCC": 2455, "GCGCCG": 2456, "GCGCCT": 2457, "GCGCGA": 2458, "GCGCGC": 2459, "GCGCGG": 2460, "GCGCGT": 2461, "GCGCTA": 2462, "GCGCTC": 2463, "GCGCTG": 2464, "GCGCTT": 2465, "GCGGAA": 2466, "GCGGAC": 2467, "GCGGAG": 2468, "GCGGAT": 2469, "GCGGCA": 2470, "GCGGCC": 2471, "GCGGCG": 2472, "GCGGCT": 2473, "GCGGGA": 2474, "GCGGGC": 2475, "GCGGGG": 2476, "GCGGGT": 2477, "GCGGTA": 2478, "GCGGTC": 2479, "GCGGTG": 2480, "GCGGTT": 2481, "GCGTAA": 2482, "GCGTAC": 2483, "GCGTAG": 2484, "GCGTAT": 2485, "GCGTCA": 2486, "GCGTCC": 2487, "GCGTCG": 2488, "GCGTCT": 2489, "GCGTGA": 2490, "GCGTGC": 2491, "GCGTGG": 2492, "GCGTGT": 2493, "GCGTTA": 2494, "GCGTTC": 2495, "GCGTTG": 2496, "GCGTTT": 2497, "GCTAAA": 2498, "GCTAAC": 2499, "GCTAAG": 2500, "GCTAAT": 2501, "GCTACA": 2502, "GCTACC": 2503, "GCTACG": 2504, "GCTACT": 2505, "GCTAGA": 2506, "GCTAGC": 2507, "GCTAGG": 2508, "GCTAGT": 2509, "GCTATA": 2510, "GCTATC": 2511, "GCTATG": 2512, "GCTATT": 2513, "GCTCAA": 2514, "GCTCAC": 2515, "GCTCAG": 2516, "GCTCAT": 2517, "GCTCCA": 2518, "GCTCCC": 2519, "GCTCCG": 2520, "GCTCCT": 2521, "GCTCGA": 2522, "GCTCGC": 2523, "GCTCGG": 2524, "GCTCGT": 2525, "GCTCTA": 2526, "GCTCTC": 2527, "GCTCTG": 2528, "GCTCTT": 2529, "GCTGAA": 2530, "GCTGAC": 2531, "GCTGAG": 2532, "GCTGAT": 2533, "GCTGCA": 2534, "GCTGCC": 2535, "GCTGCG": 2536, "GCTGCT": 2537, "GCTGGA": 2538, "GCTGGC": 2539, "GCTGGG": 2540, "GCTGGT": 2541, "GCTGTA": 2542, "GCTGTC": 2543, "GCTGTG": 2544, "GCTGTT": 2545, "GCTTAA": 2546, "GCTTAC": 2547, "GCTTAG": 2548, "GCTTAT": 2549, "GCTTCA": 2550, "GCTTCC": 2551, "GCTTCG": 2552, "GCTTCT": 2553, "GCTTGA": 2554, "GCTTGC": 2555, "GCTTGG": 2556, "GCTTGT": 2557, "GCTTTA": 2558, "GCTTTC": 2559, "GCTTTG": 2560, "GCTTTT": 2561, "GGAAAA": 2562, "GGAAAC": 2563, "GGAAAG": 2564, "GGAAAT": 2565, "GGAACA": 2566, "GGAACC": 2567, "GGAACG": 2568, "GGAACT": 2569, "GGAAGA": 2570, "GGAAGC": 2571, "GGAAGG": 2572, "GGAAGT": 2573, "GGAATA": 2574, "GGAATC": 2575, "GGAATG": 2576, "GGAATT": 2577, "GGACAA": 2578, "GGACAC": 2579, "GGACAG": 2580, "GGACAT": 2581, "GGACCA": 2582, "GGACCC": 2583, "GGACCG": 2584, "GGACCT": 2585, "GGACGA": 2586, "GGACGC": 2587, "GGACGG": 2588, "GGACGT": 2589, "GGACTA": 2590, "GGACTC": 2591, "GGACTG": 2592, "GGACTT": 2593, "GGAGAA": 2594, "GGAGAC": 2595, "GGAGAG": 2596, "GGAGAT": 2597, "GGAGCA": 2598, "GGAGCC": 2599, "GGAGCG": 2600, "GGAGCT": 2601, "GGAGGA": 2602, "GGAGGC": 2603, "GGAGGG": 2604, "GGAGGT": 2605, "GGAGTA": 2606, "GGAGTC": 2607, "GGAGTG": 2608, "GGAGTT": 2609, "GGATAA": 2610, "GGATAC": 2611, "GGATAG": 2612, "GGATAT": 2613, "GGATCA": 2614, "GGATCC": 2615, "GGATCG": 2616, "GGATCT": 2617, "GGATGA": 2618, "GGATGC": 2619, "GGATGG": 2620, "GGATGT": 2621, "GGATTA": 2622, "GGATTC": 2623, "GGATTG": 2624, "GGATTT": 2625, "GGCAAA": 2626, "GGCAAC": 2627, "GGCAAG": 2628, "GGCAAT": 2629, "GGCACA": 2630, "GGCACC": 2631, "GGCACG": 2632, "GGCACT": 2633, "GGCAGA": 2634, "GGCAGC": 2635, "GGCAGG": 2636, "GGCAGT": 2637, "GGCATA": 2638, "GGCATC": 2639, "GGCATG": 2640, "GGCATT": 2641, "GGCCAA": 2642, "GGCCAC": 2643, "GGCCAG": 2644, "GGCCAT": 2645, "GGCCCA": 2646, "GGCCCC": 2647, "GGCCCG": 2648, "GGCCCT": 2649, "GGCCGA": 2650, "GGCCGC": 2651, "GGCCGG": 2652, "GGCCGT": 2653, "GGCCTA": 2654, "GGCCTC": 2655, "GGCCTG": 2656, "GGCCTT": 2657, "GGCGAA": 2658, "GGCGAC": 2659, "GGCGAG": 2660, "GGCGAT": 2661, "GGCGCA": 2662, "GGCGCC": 2663, "GGCGCG": 2664, "GGCGCT": 2665, "GGCGGA": 2666, "GGCGGC": 2667, "GGCGGG": 2668, "GGCGGT": 2669, "GGCGTA": 2670, "GGCGTC": 2671, "GGCGTG": 2672, "GGCGTT": 2673, "GGCTAA": 2674, "GGCTAC": 2675, "GGCTAG": 2676, "GGCTAT": 2677, "GGCTCA": 2678, "GGCTCC": 2679, "GGCTCG": 2680, "GGCTCT": 2681, "GGCTGA": 2682, "GGCTGC": 2683, "GGCTGG": 2684, "GGCTGT": 2685, "GGCTTA": 2686, "GGCTTC": 2687, "GGCTTG": 2688, "GGCTTT": 2689, "GGGAAA": 2690, "GGGAAC": 2691, "GGGAAG": 2692, "GGGAAT": 2693, "GGGACA": 2694, "GGGACC": 2695, "GGGACG": 2696, "GGGACT": 2697, "GGGAGA": 2698, "GGGAGC": 2699, "GGGAGG": 2700, "GGGAGT": 2701, "GGGATA": 2702, "GGGATC": 2703, "GGGATG": 2704, "GGGATT": 2705, "GGGCAA": 2706, "GGGCAC": 2707, "GGGCAG": 2708, "GGGCAT": 2709, "GGGCCA": 2710, "GGGCCC": 2711, "GGGCCG": 2712, "GGGCCT": 2713, "GGGCGA": 2714, "GGGCGC": 2715, "GGGCGG": 2716, "GGGCGT": 2717, "GGGCTA": 2718, "GGGCTC": 2719, "GGGCTG": 2720, "GGGCTT": 2721, "GGGGAA": 2722, "GGGGAC": 2723, "GGGGAG": 2724, "GGGGAT": 2725, "GGGGCA": 2726, "GGGGCC": 2727, "GGGGCG": 2728, "GGGGCT": 2729, "GGGGGA": 2730, "GGGGGC": 2731, "GGGGGG": 2732, "GGGGGT": 2733, "GGGGTA": 2734, "GGGGTC": 2735, "GGGGTG": 2736, "GGGGTT": 2737, "GGGTAA": 2738, "GGGTAC": 2739, "GGGTAG": 2740, "GGGTAT": 2741, "GGGTCA": 2742, "GGGTCC": 2743, "GGGTCG": 2744, "GGGTCT": 2745, "GGGTGA": 2746, "GGGTGC": 2747, "GGGTGG": 2748, "GGGTGT": 2749, "GGGTTA": 2750, "GGGTTC": 2751, "GGGTTG": 2752, "GGGTTT": 2753, "GGTAAA": 2754, "GGTAAC": 2755, "GGTAAG": 2756, "GGTAAT": 2757, "GGTACA": 2758, "GGTACC": 2759, "GGTACG": 2760, "GGTACT": 2761, "GGTAGA": 2762, "GGTAGC": 2763, "GGTAGG": 2764, "GGTAGT": 2765, "GGTATA": 2766, "GGTATC": 2767, "GGTATG": 2768, "GGTATT": 2769, "GGTCAA": 2770, "GGTCAC": 2771, "GGTCAG": 2772, "GGTCAT": 2773, "GGTCCA": 2774, "GGTCCC": 2775, "GGTCCG": 2776, "GGTCCT": 2777, "GGTCGA": 2778, "GGTCGC": 2779, "GGTCGG": 2780, "GGTCGT": 2781, "GGTCTA": 2782, "GGTCTC": 2783, "GGTCTG": 2784, "GGTCTT": 2785, "GGTGAA": 2786, "GGTGAC": 2787, "GGTGAG": 2788, "GGTGAT": 2789, "GGTGCA": 2790, "GGTGCC": 2791, "GGTGCG": 2792, "GGTGCT": 2793, "GGTGGA": 2794, "GGTGGC": 2795, "GGTGGG": 2796, "GGTGGT": 2797, "GGTGTA": 2798, "GGTGTC": 2799, "GGTGTG": 2800, "GGTGTT": 2801, "GGTTAA": 2802, "GGTTAC": 2803, "GGTTAG": 2804, "GGTTAT": 2805, "GGTTCA": 2806, "GGTTCC": 2807, "GGTTCG": 2808, "GGTTCT": 2809, "GGTTGA": 2810, "GGTTGC": 2811, "GGTTGG": 2812, "GGTTGT": 2813, "GGTTTA": 2814, "GGTTTC": 2815, "GGTTTG": 2816, "GGTTTT": 2817, "GTAAAA": 2818, "GTAAAC": 2819, "GTAAAG": 2820, "GTAAAT": 2821, "GTAACA": 2822, "GTAACC": 2823, "GTAACG": 2824, "GTAACT": 2825, "GTAAGA": 2826, "GTAAGC": 2827, "GTAAGG": 2828, "GTAAGT": 2829, "GTAATA": 2830, "GTAATC": 2831, "GTAATG": 2832, "GTAATT": 2833, "GTACAA": 2834, "GTACAC": 2835, "GTACAG": 2836, "GTACAT": 2837, "GTACCA": 2838, "GTACCC": 2839, "GTACCG": 2840, "GTACCT": 2841, "GTACGA": 2842, "GTACGC": 2843, "GTACGG": 2844, "GTACGT": 2845, "GTACTA": 2846, "GTACTC": 2847, "GTACTG": 2848, "GTACTT": 2849, "GTAGAA": 2850, "GTAGAC": 2851, "GTAGAG": 2852, "GTAGAT": 2853, "GTAGCA": 2854, "GTAGCC": 2855, "GTAGCG": 2856, "GTAGCT": 2857, "GTAGGA": 2858, "GTAGGC": 2859, "GTAGGG": 2860, "GTAGGT": 2861, "GTAGTA": 2862, "GTAGTC": 2863, "GTAGTG": 2864, "GTAGTT": 2865, "GTATAA": 2866, "GTATAC": 2867, "GTATAG": 2868, "GTATAT": 2869, "GTATCA": 2870, "GTATCC": 2871, "GTATCG": 2872, "GTATCT": 2873, "GTATGA": 2874, "GTATGC": 2875, "GTATGG": 2876, "GTATGT": 2877, "GTATTA": 2878, "GTATTC": 2879, "GTATTG": 2880, "GTATTT": 2881, "GTCAAA": 2882, "GTCAAC": 2883, "GTCAAG": 2884, "GTCAAT": 2885, "GTCACA": 2886, "GTCACC": 2887, "GTCACG": 2888, "GTCACT": 2889, "GTCAGA": 2890, "GTCAGC": 2891, "GTCAGG": 2892, "GTCAGT": 2893, "GTCATA": 2894, "GTCATC": 2895, "GTCATG": 2896, "GTCATT": 2897, "GTCCAA": 2898, "GTCCAC": 2899, "GTCCAG": 2900, "GTCCAT": 2901, "GTCCCA": 2902, "GTCCCC": 2903, "GTCCCG": 2904, "GTCCCT": 2905, "GTCCGA": 2906, "GTCCGC": 2907, "GTCCGG": 2908, "GTCCGT": 2909, "GTCCTA": 2910, "GTCCTC": 2911, "GTCCTG": 2912, "GTCCTT": 2913, "GTCGAA": 2914, "GTCGAC": 2915, "GTCGAG": 2916, "GTCGAT": 2917, "GTCGCA": 2918, "GTCGCC": 2919, "GTCGCG": 2920, "GTCGCT": 2921, "GTCGGA": 2922, "GTCGGC": 2923, "GTCGGG": 2924, "GTCGGT": 2925, "GTCGTA": 2926, "GTCGTC": 2927, "GTCGTG": 2928, "GTCGTT": 2929, "GTCTAA": 2930, "GTCTAC": 2931, "GTCTAG": 2932, "GTCTAT": 2933, "GTCTCA": 2934, "GTCTCC": 2935, "GTCTCG": 2936, "GTCTCT": 2937, "GTCTGA": 2938, "GTCTGC": 2939, "GTCTGG": 2940, "GTCTGT": 2941, "GTCTTA": 2942, "GTCTTC": 2943, "GTCTTG": 2944, "GTCTTT": 2945, "GTGAAA": 2946, "GTGAAC": 2947, "GTGAAG": 2948, "GTGAAT": 2949, "GTGACA": 2950, "GTGACC": 2951, "GTGACG": 2952, "GTGACT": 2953, "GTGAGA": 2954, "GTGAGC": 2955, "GTGAGG": 2956, "GTGAGT": 2957, "GTGATA": 2958, "GTGATC": 2959, "GTGATG": 2960, "GTGATT": 2961, "GTGCAA": 2962, "GTGCAC": 2963, "GTGCAG": 2964, "GTGCAT": 2965, "GTGCCA": 2966, "GTGCCC": 2967, "GTGCCG": 2968, "GTGCCT": 2969, "GTGCGA": 2970, "GTGCGC": 2971, "GTGCGG": 2972, "GTGCGT": 2973, "GTGCTA": 2974, "GTGCTC": 2975, "GTGCTG": 2976, "GTGCTT": 2977, "GTGGAA": 2978, "GTGGAC": 2979, "GTGGAG": 2980, "GTGGAT": 2981, "GTGGCA": 2982, "GTGGCC": 2983, "GTGGCG": 2984, "GTGGCT": 2985, "GTGGGA": 2986, "GTGGGC": 2987, "GTGGGG": 2988, "GTGGGT": 2989, "GTGGTA": 2990, "GTGGTC": 2991, "GTGGTG": 2992, "GTGGTT": 2993, "GTGTAA": 2994, "GTGTAC": 2995, "GTGTAG": 2996, "GTGTAT": 2997, "GTGTCA": 2998, "GTGTCC": 2999, "GTGTCG": 3000, "GTGTCT": 3001, "GTGTGA": 3002, "GTGTGC": 3003, "GTGTGG": 3004, "GTGTGT": 3005, "GTGTTA": 3006, "GTGTTC": 3007, "GTGTTG": 3008, "GTGTTT": 3009, "GTTAAA": 3010, "GTTAAC": 3011, "GTTAAG": 3012, "GTTAAT": 3013, "GTTACA": 3014, "GTTACC": 3015, "GTTACG": 3016, "GTTACT": 3017, "GTTAGA": 3018, "GTTAGC": 3019, "GTTAGG": 3020, "GTTAGT": 3021, "GTTATA": 3022, "GTTATC": 3023, "GTTATG": 3024, "GTTATT": 3025, "GTTCAA": 3026, "GTTCAC": 3027, "GTTCAG": 3028, "GTTCAT": 3029, "GTTCCA": 3030, "GTTCCC": 3031, "GTTCCG": 3032, "GTTCCT": 3033, "GTTCGA": 3034, "GTTCGC": 3035, "GTTCGG": 3036, "GTTCGT": 3037, "GTTCTA": 3038, "GTTCTC": 3039, "GTTCTG": 3040, "GTTCTT": 3041, "GTTGAA": 3042, "GTTGAC": 3043, "GTTGAG": 3044, "GTTGAT": 3045, "GTTGCA": 3046, "GTTGCC": 3047, "GTTGCG": 3048, "GTTGCT": 3049, "GTTGGA": 3050, "GTTGGC": 3051, "GTTGGG": 3052, "GTTGGT": 3053, "GTTGTA": 3054, "GTTGTC": 3055, "GTTGTG": 3056, "GTTGTT": 3057, "GTTTAA": 3058, "GTTTAC": 3059, "GTTTAG": 3060, "GTTTAT": 3061, "GTTTCA": 3062, "GTTTCC": 3063, "GTTTCG": 3064, "GTTTCT": 3065, "GTTTGA": 3066, "GTTTGC": 3067, "GTTTGG": 3068, "GTTTGT": 3069, "GTTTTA": 3070, "GTTTTC": 3071, "GTTTTG": 3072, "GTTTTT": 3073, "TAAAAA": 3074, "TAAAAC": 3075, "TAAAAG": 3076, "TAAAAT": 3077, "TAAACA": 3078, "TAAACC": 3079, "TAAACG": 3080, "TAAACT": 3081, "TAAAGA": 3082, "TAAAGC": 3083, "TAAAGG": 3084, "TAAAGT": 3085, "TAAATA": 3086, "TAAATC": 3087, "TAAATG": 3088, "TAAATT": 3089, "TAACAA": 3090, "TAACAC": 3091, "TAACAG": 3092, "TAACAT": 3093, "TAACCA": 3094, "TAACCC": 3095, "TAACCG": 3096, "TAACCT": 3097, "TAACGA": 3098, "TAACGC": 3099, "TAACGG": 3100, "TAACGT": 3101, "TAACTA": 3102, "TAACTC": 3103, "TAACTG": 3104, "TAACTT": 3105, "TAAGAA": 3106, "TAAGAC": 3107, "TAAGAG": 3108, "TAAGAT": 3109, "TAAGCA": 3110, "TAAGCC": 3111, "TAAGCG": 3112, "TAAGCT": 3113, "TAAGGA": 3114, "TAAGGC": 3115, "TAAGGG": 3116, "TAAGGT": 3117, "TAAGTA": 3118, "TAAGTC": 3119, "TAAGTG": 3120, "TAAGTT": 3121, "TAATAA": 3122, "TAATAC": 3123, "TAATAG": 3124, "TAATAT": 3125, "TAATCA": 3126, "TAATCC": 3127, "TAATCG": 3128, "TAATCT": 3129, "TAATGA": 3130, "TAATGC": 3131, "TAATGG": 3132, "TAATGT": 3133, "TAATTA": 3134, "TAATTC": 3135, "TAATTG": 3136, "TAATTT": 3137, "TACAAA": 3138, "TACAAC": 3139, "TACAAG": 3140, "TACAAT": 3141, "TACACA": 3142, "TACACC": 3143, "TACACG": 3144, "TACACT": 3145, "TACAGA": 3146, "TACAGC": 3147, "TACAGG": 3148, "TACAGT": 3149, "TACATA": 3150, "TACATC": 3151, "TACATG": 3152, "TACATT": 3153, "TACCAA": 3154, "TACCAC": 3155, "TACCAG": 3156, "TACCAT": 3157, "TACCCA": 3158, "TACCCC": 3159, "TACCCG": 3160, "TACCCT": 3161, "TACCGA": 3162, "TACCGC": 3163, "TACCGG": 3164, "TACCGT": 3165, "TACCTA": 3166, "TACCTC": 3167, "TACCTG": 3168, "TACCTT": 3169, "TACGAA": 3170, "TACGAC": 3171, "TACGAG": 3172, "TACGAT": 3173, "TACGCA": 3174, "TACGCC": 3175, "TACGCG": 3176, "TACGCT": 3177, "TACGGA": 3178, "TACGGC": 3179, "TACGGG": 3180, "TACGGT": 3181, "TACGTA": 3182, "TACGTC": 3183, "TACGTG": 3184, "TACGTT": 3185, "TACTAA": 3186, "TACTAC": 3187, "TACTAG": 3188, "TACTAT": 3189, "TACTCA": 3190, "TACTCC": 3191, "TACTCG": 3192, "TACTCT": 3193, 